app/views/jobs/show.html.erb

<p>
  <%= pluralize(@job.comments.size, "comment")%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."job_id" = ?  [["job_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."job_id" = ?  [["job_id", 6]]