app/controllers/comments_controller.rb

  def create
    @job = Job.find(params[:job_id])
    @comment = @job.comments.build(comment_params)
    if  @comment.save
---
INSERT INTO "comments" ("name", "body", "job_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "erica"], ["body", "testetets"], ["job_id", 1], ["created_at", 2016-09-28 08:49:25 UTC], ["updated_at", 2016-09-28 08:49:25 UTC]]

  def set_comment
    id = params[:id]
    @comment = Comment.find(id)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]